app/controllers/apartments_controller.rb

    def create
      @apartment = current_landlord.apartments.create(apartment_params)
---
INSERT INTO "apartments" ("name", "image", "price", "created_at", "updated_at", "landlord_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Hero"], ["image", "https://rb.gy/idlq"], ["price", 13000.0], ["created_at", "2023-04-06 00:22:29.317119"], ["updated_at", "2023-04-06 00:22:29.317119"], ["landlord_id", 8]]

    def update
      if @apartment.update(apartment_params)
---
UPDATE "apartments" SET "updated_at" = ?, "is_on_sale" = ? WHERE "apartments"."id" = ?  [["updated_at", "2023-04-06 09:59:43.029106"], ["is_on_sale", "sold"], ["id", 1]]

    def destroy
      @apartment.destroy
---
DELETE FROM "apartments" WHERE "apartments"."id" = ?  [["id", 2]]

    def set_apartment
      @apartment = current_landlord.apartments.find(params[:id])
---
SELECT "apartments".* FROM "apartments" WHERE "apartments"."landlord_id" = ? AND "apartments"."id" = ? LIMIT ?  [["landlord_id", 8], ["id", 2], ["LIMIT", 1]]