app/controllers/application_controller.rb

  def current_landlord
    @current_landlord ||= Landlord.find_by(id: session[:landlord_id])
---
SELECT "landlords".* FROM "landlords" WHERE "landlords"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]