app/controllers/contacts_controller.rb

    def create
        contact = Contact.create!(contact_params)
---
INSERT INTO "contacts" ("name", "email", "subject", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)