app/controllers/landlords_controller.rb

INSERT INTO "landlords" ("fname", "lname", "email", "password_digest", "phoneNumber", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        landlord = Landlord.create(landlord_params)

SELECT "landlords".* FROM "landlords" WHERE "landlords"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        landlord = Landlord.find_by(id: session[:landlord_id])