app/controllers/sessions_controller.rb

    def create
        landlord = Landlord.find_by(email: params[:email])
---
SELECT "landlords".* FROM "landlords" WHERE "landlords"."email" = ? LIMIT ?  [["email", "kiragucollins@gmail.com"], ["LIMIT", 1]]