app/controllers/todos_controller.rb

    def create
      @todo = current_landlord.todos.create(todo_params)
---
INSERT INTO "todos" ("landlord_id", "title", "description", "category", "priority", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update
      if @todo.update(todo_params)
---
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2023-04-06 14:44:45.109116"], ["id", 2]]

    def destroy
      @todo.destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]

    def set_todo
      @todo = current_landlord.todos.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."landlord_id" = ? AND "todos"."id" = ? LIMIT ?  [["landlord_id", 1], ["id", 1], ["LIMIT", 1]]